; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	satellite4 - satellite
	instrument9 - instrument
	satellite5 - satellite
	instrument10 - instrument
	instrument11 - instrument
	satellite6 - satellite
	instrument12 - instrument
	instrument13 - instrument
	instrument14 - instrument
	satellite7 - satellite
	instrument15 - instrument
	thermograph2 - mode
	infrared1 - mode
	infrared0 - mode
	Star0 - direction
	GroundStation5 - direction
	Star1 - direction
	GroundStation2 - direction
	GroundStation3 - direction
	Star4 - direction
	Planet6 - direction
	Star7 - direction
	Planet8 - direction
	Planet9 - direction
	Star10 - direction
	Planet11 - direction
)
(:init
	(supports instrument0 infrared1)
	(supports instrument0 thermograph2)
	(calibration_target instrument0 Star4)
	(supports instrument1 infrared0)
	(calibration_target instrument1 GroundStation3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation3)
	(supports instrument2 infrared0)
	(calibration_target instrument2 GroundStation5)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet9)
	(supports instrument3 infrared0)
	(supports instrument3 thermograph2)
	(calibration_target instrument3 Star0)
	(supports instrument4 infrared1)
	(supports instrument4 infrared0)
	(supports instrument4 thermograph2)
	(calibration_target instrument4 GroundStation5)
	(calibration_target instrument4 Star1)
	(supports instrument5 infrared1)
	(supports instrument5 thermograph2)
	(calibration_target instrument5 GroundStation2)
	(calibration_target instrument5 GroundStation5)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet11)
	(supports instrument6 infrared1)
	(supports instrument6 thermograph2)
	(calibration_target instrument6 GroundStation2)
	(supports instrument7 infrared1)
	(calibration_target instrument7 Star4)
	(supports instrument8 infrared1)
	(supports instrument8 infrared0)
	(supports instrument8 thermograph2)
	(calibration_target instrument8 GroundStation5)
	(calibration_target instrument8 Star4)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star1)
	(supports instrument9 infrared0)
	(supports instrument9 infrared1)
	(supports instrument9 thermograph2)
	(calibration_target instrument9 Star1)
	(calibration_target instrument9 Star4)
	(on_board instrument9 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation5)
	(supports instrument10 infrared0)
	(calibration_target instrument10 GroundStation3)
	(calibration_target instrument10 GroundStation2)
	(supports instrument11 infrared0)
	(supports instrument11 thermograph2)
	(calibration_target instrument11 Star1)
	(calibration_target instrument11 GroundStation5)
	(on_board instrument10 satellite5)
	(on_board instrument11 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Planet8)
	(supports instrument12 thermograph2)
	(calibration_target instrument12 GroundStation3)
	(supports instrument13 thermograph2)
	(supports instrument13 infrared1)
	(supports instrument13 infrared0)
	(calibration_target instrument13 GroundStation3)
	(supports instrument14 infrared0)
	(calibration_target instrument14 GroundStation2)
	(on_board instrument12 satellite6)
	(on_board instrument13 satellite6)
	(on_board instrument14 satellite6)
	(power_avail satellite6)
	(pointing satellite6 Star0)
	(supports instrument15 infrared0)
	(supports instrument15 infrared1)
	(supports instrument15 thermograph2)
	(calibration_target instrument15 Star4)
	(calibration_target instrument15 GroundStation3)
	(on_board instrument15 satellite7)
	(power_avail satellite7)
	(pointing satellite7 Planet8)
)
(:goal (and
	(pointing satellite0 GroundStation5)
	(pointing satellite1 Star1)
	(pointing satellite4 Star4)
	(have_image Planet6 infrared1)
	(have_image Star7 thermograph2)
	(have_image Planet8 thermograph2)
	(have_image Planet9 infrared1)
	(have_image Star10 infrared0)
	(have_image Planet11 thermograph2)
))

)

; plan
1. (turn_to satellite4 star4 groundstation5)
   deleted: (pointing satellite4 groundstation5)
   added: (pointing satellite4 star4)
   goals met: 1 of 9
2. (turn_to satellite2 groundstation5 planet11)
   deleted: (pointing satellite2 planet11)
   added: (pointing satellite2 groundstation5)
   goals met: 1 of 9
3. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 1 of 9
4. (calibrate satellite2 instrument4 groundstation5)
   added: (calibrated instrument4)
   goals met: 1 of 9
5. (turn_to satellite2 planet8 groundstation5)
   deleted: (pointing satellite2 groundstation5)
   added: (pointing satellite2 planet8)
   goals met: 1 of 9
6. (take_image satellite2 planet8 instrument4 thermograph2)
   added: (have_image planet8 thermograph2)
   goals met: 2 of 9
7. (turn_to satellite2 planet6 planet8)
   deleted: (pointing satellite2 planet8)
   added: (pointing satellite2 planet6)
   goals met: 2 of 9
8. (take_image satellite2 planet6 instrument4 infrared1)
   added: (have_image planet6 infrared1)
   goals met: 3 of 9
9. (turn_to satellite2 planet11 planet6)
   deleted: (pointing satellite2 planet6)
   added: (pointing satellite2 planet11)
   goals met: 3 of 9
10. (turn_to satellite1 star1 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 star1)
   goals met: 4 of 9
11. (turn_to satellite0 groundstation5 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 groundstation5)
   goals met: 5 of 9
12. (take_image satellite2 planet11 instrument4 thermograph2)
   added: (have_image planet11 thermograph2)
   goals met: 6 of 9
13. (turn_to satellite2 planet9 planet11)
   deleted: (pointing satellite2 planet11)
   added: (pointing satellite2 planet9)
   goals met: 6 of 9
14. (take_image satellite2 planet9 instrument4 infrared1)
   added: (have_image planet9 infrared1)
   goals met: 7 of 9
15. (turn_to satellite2 star10 planet9)
   deleted: (pointing satellite2 planet9)
   added: (pointing satellite2 star10)
   goals met: 7 of 9
16. (take_image satellite2 star10 instrument4 infrared0)
   added: (have_image star10 infrared0)
   goals met: 8 of 9
17. (turn_to satellite2 star7 star10)
   deleted: (pointing satellite2 star10)
   added: (pointing satellite2 star7)
   goals met: 8 of 9
18. (take_image satellite2 star7 instrument4 thermograph2)
   added: (have_image star7 thermograph2)
   goals met: 9 of 9
